zephyrproject-rtos/hal_gigadevice/include/dt-bindings/pinctrl/gd32f450z(e-g-i-k)xx-pinctrl.h
/*
 * Autogenerated file
 *
 * SPDX-License-Identifier: Apache 2.0
 */

#include "gd32-af.h"

/* ADC012_IN0 */
#define ADC012_IN0_PA0 \
	GD32_PINMUX_AF('A', 0, ANALOG)

/* ADC012_IN1 */
#define ADC012_IN1_PA1 \
	GD32_PINMUX_AF('A', 1, ANALOG)

/* ADC012_IN10 */
#define ADC012_IN10_PC0 \
	GD32_PINMUX_AF('C', 0, ANALOG)

/* ADC012_IN11 */
#define ADC012_IN11_PC1 \
	GD32_PINMUX_AF('C', 1, ANALOG)

/* ADC012_IN12 */
#define ADC012_IN12_PC2 \
	GD32_PINMUX_AF('C', 2, ANALOG)

/* ADC012_IN13 */
#define ADC012_IN13_PC3 \
	GD32_PINMUX_AF('C', 3, ANALOG)

/* ADC012_IN2 */
#define ADC012_IN2_PA2 \
	GD32_PINMUX_AF('A', 2, ANALOG)

/* ADC012_IN3 */
#define ADC012_IN3_PA3 \
	GD32_PINMUX_AF('A', 3, ANALOG)

/* ADC01_IN14 */
#define ADC01_IN14_PC4 \
	GD32_PINMUX_AF('C', 4, ANALOG)

/* ADC01_IN15 */
#define ADC01_IN15_PC5 \
	GD32_PINMUX_AF('C', 5, ANALOG)

/* ADC01_IN4 */
#define ADC01_IN4_PA4 \
	GD32_PINMUX_AF('A', 4, ANALOG)

/* ADC01_IN5 */
#define ADC01_IN5_PA5 \
	GD32_PINMUX_AF('A', 5, ANALOG)

/* ADC01_IN6 */
#define ADC01_IN6_PA6 \
	GD32_PINMUX_AF('A', 6, ANALOG)

/* ADC01_IN7 */
#define ADC01_IN7_PA7 \
	GD32_PINMUX_AF('A', 7, ANALOG)

/* ADC01_IN8 */
#define ADC01_IN8_PB0 \
	GD32_PINMUX_AF('B', 0, ANALOG)

/* ADC01_IN9 */
#define ADC01_IN9_PB1 \
	GD32_PINMUX_AF('B', 1, ANALOG)

/* ADC2_IN14 */
#define ADC2_IN14_PF4 \
	GD32_PINMUX_AF('F', 4, ANALOG)

/* ADC2_IN15 */
#define ADC2_IN15_PF5 \
	GD32_PINMUX_AF('F', 5, ANALOG)

/* ADC2_IN4 */
#define ADC2_IN4_PF6 \
	GD32_PINMUX_AF('F', 6, ANALOG)

/* ADC2_IN5 */
#define ADC2_IN5_PF7 \
	GD32_PINMUX_AF('F', 7, ANALOG)

/* ADC2_IN6 */
#define ADC2_IN6_PF8 \
	GD32_PINMUX_AF('F', 8, ANALOG)

/* ADC2_IN7 */
#define ADC2_IN7_PF9 \
	GD32_PINMUX_AF('F', 9, ANALOG)

/* ADC2_IN8 */
#define ADC2_IN8_PF10 \
	GD32_PINMUX_AF('F', 10, ANALOG)

/* ADC2_IN9 */
#define ADC2_IN9_PF3 \
	GD32_PINMUX_AF('F', 3, ANALOG)

/* CAN0_RX */
#define CAN0_RX_PA11 \
	GD32_PINMUX_AF('A', 11, AF9)
#define CAN0_RX_PB8 \
	GD32_PINMUX_AF('B', 8, AF9)
#define CAN0_RX_PD0 \
	GD32_PINMUX_AF('D', 0, AF9)

/* CAN0_TX */
#define CAN0_TX_PA12 \
	GD32_PINMUX_AF('A', 12, AF9)
#define CAN0_TX_PB9 \
	GD32_PINMUX_AF('B', 9, AF9)
#define CAN0_TX_PD1 \
	GD32_PINMUX_AF('D', 1, AF9)

/* CAN1_RX */
#define CAN1_RX_PB5 \
	GD32_PINMUX_AF('B', 5, AF9)
#define CAN1_RX_PB12 \
	GD32_PINMUX_AF('B', 12, AF9)

/* CAN1_TX */
#define CAN1_TX_PB6 \
	GD32_PINMUX_AF('B', 6, AF9)
#define CAN1_TX_PB13 \
	GD32_PINMUX_AF('B', 13, AF9)

/* CK_OUT0 */
#define CK_OUT0_PA8 \
	GD32_PINMUX_AF('A', 8, AF0)

/* CK_OUT1 */
#define CK_OUT1_PC9 \
	GD32_PINMUX_AF('C', 9, AF0)

/* CTC_SYNC */
#define CTC_SYNC_PA8 \
	GD32_PINMUX_AF('A', 8, AF9)
#define CTC_SYNC_PD15 \
	GD32_PINMUX_AF('D', 15, AF0)
#define CTC_SYNC_PF0 \
	GD32_PINMUX_AF('F', 0, AF0)

/* DAC_OUT1 */
#define DAC_OUT1_PA5 \
	GD32_PINMUX_AF('A', 5, ANALOG)

/* DCI_D0 */
#define DCI_D0_PA9 \
	GD32_PINMUX_AF('A', 9, AF13)
#define DCI_D0_PC6 \
	GD32_PINMUX_AF('C', 6, AF13)

/* DCI_D1 */
#define DCI_D1_PA10 \
	GD32_PINMUX_AF('A', 10, AF13)
#define DCI_D1_PC7 \
	GD32_PINMUX_AF('C', 7, AF13)

/* DCI_D10 */
#define DCI_D10_PB5 \
	GD32_PINMUX_AF('B', 5, AF13)
#define DCI_D10_PD6 \
	GD32_PINMUX_AF('D', 6, AF13)

/* DCI_D11 */
#define DCI_D11_PD2 \
	GD32_PINMUX_AF('D', 2, AF13)
#define DCI_D11_PF10 \
	GD32_PINMUX_AF('F', 10, AF13)

/* DCI_D12 */
#define DCI_D12_PF11 \
	GD32_PINMUX_AF('F', 11, AF13)
#define DCI_D12_PG6 \
	GD32_PINMUX_AF('G', 6, AF13)

/* DCI_D13 */
#define DCI_D13_PG7 \
	GD32_PINMUX_AF('G', 7, AF13)
#define DCI_D13_PG15 \
	GD32_PINMUX_AF('G', 15, AF13)

/* DCI_D2 */
#define DCI_D2_PC8 \
	GD32_PINMUX_AF('C', 8, AF13)
#define DCI_D2_PE0 \
	GD32_PINMUX_AF('E', 0, AF13)
#define DCI_D2_PG10 \
	GD32_PINMUX_AF('G', 10, AF13)

/* DCI_D3 */
#define DCI_D3_PC9 \
	GD32_PINMUX_AF('C', 9, AF13)
#define DCI_D3_PE1 \
	GD32_PINMUX_AF('E', 1, AF13)
#define DCI_D3_PG11 \
	GD32_PINMUX_AF('G', 11, AF13)

/* DCI_D4 */
#define DCI_D4_PC11 \
	GD32_PINMUX_AF('C', 11, AF13)
#define DCI_D4_PE4 \
	GD32_PINMUX_AF('E', 4, AF13)

/* DCI_D5 */
#define DCI_D5_PB6 \
	GD32_PINMUX_AF('B', 6, AF13)
#define DCI_D5_PD3 \
	GD32_PINMUX_AF('D', 3, AF13)

/* DCI_D6 */
#define DCI_D6_PB8 \
	GD32_PINMUX_AF('B', 8, AF13)
#define DCI_D6_PE5 \
	GD32_PINMUX_AF('E', 5, AF13)

/* DCI_D7 */
#define DCI_D7_PB9 \
	GD32_PINMUX_AF('B', 9, AF13)
#define DCI_D7_PE6 \
	GD32_PINMUX_AF('E', 6, AF13)

/* DCI_D8 */
#define DCI_D8_PC10 \
	GD32_PINMUX_AF('C', 10, AF13)

/* DCI_D9 */
#define DCI_D9_PC12 \
	GD32_PINMUX_AF('C', 12, AF13)

/* DCI_HSYNC */
#define DCI_HSYNC_PA4 \
	GD32_PINMUX_AF('A', 4, AF13)

/* DCI_PIXCLK */
#define DCI_PIXCLK_PA6 \
	GD32_PINMUX_AF('A', 6, AF13)

/* DCI_VSYNC */
#define DCI_VSYNC_PB7 \
	GD32_PINMUX_AF('B', 7, AF13)
#define DCI_VSYNC_PG9 \
	GD32_PINMUX_AF('G', 9, AF13)

/* ETH_MDC */
#define ETH_MDC_PC1 \
	GD32_PINMUX_AF('C', 1, AF11)

/* ETH_MDIO */
#define ETH_MDIO_PA2 \
	GD32_PINMUX_AF('A', 2, AF11)

/* ETH_MII_COL */
#define ETH_MII_COL_PA3 \
	GD32_PINMUX_AF('A', 3, AF11)

/* ETH_MII_CRS */
#define ETH_MII_CRS_PA0 \
	GD32_PINMUX_AF('A', 0, AF11)

/* ETH_MII_RXD0 */
#define ETH_MII_RXD0_PC4 \
	GD32_PINMUX_AF('C', 4, AF11)

/* ETH_MII_RXD1 */
#define ETH_MII_RXD1_PC5 \
	GD32_PINMUX_AF('C', 5, AF11)

/* ETH_MII_RXD2 */
#define ETH_MII_RXD2_PB0 \
	GD32_PINMUX_AF('B', 0, AF11)

/* ETH_MII_RXD3 */
#define ETH_MII_RXD3_PB1 \
	GD32_PINMUX_AF('B', 1, AF11)

/* ETH_MII_RX_CLK */
#define ETH_MII_RX_CLK_PA1 \
	GD32_PINMUX_AF('A', 1, AF11)

/* ETH_MII_RX_DV */
#define ETH_MII_RX_DV_PA7 \
	GD32_PINMUX_AF('A', 7, AF11)

/* ETH_MII_RX_ER */
#define ETH_MII_RX_ER_PB10 \
	GD32_PINMUX_AF('B', 10, AF11)

/* ETH_MII_TXD0 */
#define ETH_MII_TXD0_PB12 \
	GD32_PINMUX_AF('B', 12, AF11)
#define ETH_MII_TXD0_PG13 \
	GD32_PINMUX_AF('G', 13, AF11)

/* ETH_MII_TXD1 */
#define ETH_MII_TXD1_PB13 \
	GD32_PINMUX_AF('B', 13, AF11)
#define ETH_MII_TXD1_PG14 \
	GD32_PINMUX_AF('G', 14, AF11)

/* ETH_MII_TXD2 */
#define ETH_MII_TXD2_PC2 \
	GD32_PINMUX_AF('C', 2, AF11)

/* ETH_MII_TXD3 */
#define ETH_MII_TXD3_PB8 \
	GD32_PINMUX_AF('B', 8, AF11)
#define ETH_MII_TXD3_PE2 \
	GD32_PINMUX_AF('E', 2, AF11)

/* ETH_MII_TX_CLK */
#define ETH_MII_TX_CLK_PC3 \
	GD32_PINMUX_AF('C', 3, AF11)

/* ETH_MII_TX_EN */
#define ETH_MII_TX_EN_PB11 \
	GD32_PINMUX_AF('B', 11, AF11)
#define ETH_MII_TX_EN_PG11 \
	GD32_PINMUX_AF('G', 11, AF11)

/* ETH_PPS_OUT */
#define ETH_PPS_OUT_PB5 \
	GD32_PINMUX_AF('B', 5, AF11)
#define ETH_PPS_OUT_PG8 \
	GD32_PINMUX_AF('G', 8, AF11)

/* ETH_RMII_CRS_DV */
#define ETH_RMII_CRS_DV_PA7 \
	GD32_PINMUX_AF('A', 7, AF11)

