zephyrproject-rtos/hal_gigadevice/include/dt-bindings/pinctrl/gd32f450z(e-g-i-k)xx-pinctrl.h
/* USART2_CK */
#define USART2_CK_PB12 \
	GD32_PINMUX_AF('B', 12, AF7)
#define USART2_CK_PC12 \
	GD32_PINMUX_AF('C', 12, AF7)
#define USART2_CK_PD10 \
	GD32_PINMUX_AF('D', 10, AF7)

/* USART2_CTS */
#define USART2_CTS_PB13 \
	GD32_PINMUX_AF('B', 13, AF7)
#define USART2_CTS_PD11 \
	GD32_PINMUX_AF('D', 11, AF7)

/* USART2_RTS */
#define USART2_RTS_PB14 \
	GD32_PINMUX_AF('B', 14, AF7)
#define USART2_RTS_PD12 \
	GD32_PINMUX_AF('D', 12, AF7)

/* USART2_RX */
#define USART2_RX_PB11 \
	GD32_PINMUX_AF('B', 11, AF7)
#define USART2_RX_PC5 \
	GD32_PINMUX_AF('C', 5, AF7)
#define USART2_RX_PC11 \
	GD32_PINMUX_AF('C', 11, AF7)
#define USART2_RX_PD9 \
	GD32_PINMUX_AF('D', 9, AF7)

/* USART2_TX */
#define USART2_TX_PB10 \
	GD32_PINMUX_AF('B', 10, AF7)
#define USART2_TX_PC10 \
	GD32_PINMUX_AF('C', 10, AF7)
#define USART2_TX_PD8 \
	GD32_PINMUX_AF('D', 8, AF7)

/* USART5_CK */
#define USART5_CK_PC8 \
	GD32_PINMUX_AF('C', 8, AF8)
#define USART5_CK_PG7 \
	GD32_PINMUX_AF('G', 7, AF8)

/* USART5_CTS */
#define USART5_CTS_PG13 \
	GD32_PINMUX_AF('G', 13, AF8)
#define USART5_CTS_PG15 \
	GD32_PINMUX_AF('G', 15, AF8)

/* USART5_RTS */
#define USART5_RTS_PG8 \
	GD32_PINMUX_AF('G', 8, AF8)
#define USART5_RTS_PG12 \
	GD32_PINMUX_AF('G', 12, AF8)

/* USART5_RX */
#define USART5_RX_PA12 \
	GD32_PINMUX_AF('A', 12, AF8)
#define USART5_RX_PC7 \
	GD32_PINMUX_AF('C', 7, AF8)
#define USART5_RX_PG9 \
	GD32_PINMUX_AF('G', 9, AF8)

/* USART5_TX */
#define USART5_TX_PA11 \
	GD32_PINMUX_AF('A', 11, AF8)
#define USART5_TX_PC6 \
	GD32_PINMUX_AF('C', 6, AF8)
#define USART5_TX_PG14 \
	GD32_PINMUX_AF('G', 14, AF8)

/* USBFS_DM */
#define USBFS_DM_PA11 \
	GD32_PINMUX_AF('A', 11, AF10)

/* USBFS_DP */
#define USBFS_DP_PA12 \
	GD32_PINMUX_AF('A', 12, AF10)

/* USBFS_ID */
#define USBFS_ID_PA10 \
	GD32_PINMUX_AF('A', 10, AF10)

/* USBFS_SOF */
#define USBFS_SOF_PA8 \
	GD32_PINMUX_AF('A', 8, AF10)

/* USBHS_DM */
#define USBHS_DM_PB14 \
	GD32_PINMUX_AF('B', 14, AF12)

/* USBHS_DP */
#define USBHS_DP_PB15 \
	GD32_PINMUX_AF('B', 15, AF12)

/* USBHS_ID */
#define USBHS_ID_PB12 \
	GD32_PINMUX_AF('B', 12, AF12)

/* USBHS_SOF */
#define USBHS_SOF_PA4 \
	GD32_PINMUX_AF('A', 4, AF12)

/* USBHS_ULPI_CK */
#define USBHS_ULPI_CK_PA5 \
	GD32_PINMUX_AF('A', 5, AF10)

/* USBHS_ULPI_D0 */
#define USBHS_ULPI_D0_PA3 \
	GD32_PINMUX_AF('A', 3, AF10)

/* USBHS_ULPI_D1 */
#define USBHS_ULPI_D1_PB0 \
	GD32_PINMUX_AF('B', 0, AF10)

/* USBHS_ULPI_D2 */
#define USBHS_ULPI_D2_PB1 \
	GD32_PINMUX_AF('B', 1, AF10)

/* USBHS_ULPI_D3 */
#define USBHS_ULPI_D3_PB10 \
	GD32_PINMUX_AF('B', 10, AF10)

/* USBHS_ULPI_D4 */
#define USBHS_ULPI_D4_PB2 \
	GD32_PINMUX_AF('B', 2, AF10)
#define USBHS_ULPI_D4_PB11 \
	GD32_PINMUX_AF('B', 11, AF10)

/* USBHS_ULPI_D5 */
#define USBHS_ULPI_D5_PB12 \
	GD32_PINMUX_AF('B', 12, AF10)

/* USBHS_ULPI_D6 */
#define USBHS_ULPI_D6_PB13 \
	GD32_PINMUX_AF('B', 13, AF10)

/* USBHS_ULPI_D7 */
#define USBHS_ULPI_D7_PB5 \
	GD32_PINMUX_AF('B', 5, AF10)

/* USBHS_ULPI_DIR */
#define USBHS_ULPI_DIR_PC2 \
	GD32_PINMUX_AF('C', 2, AF10)

/* USBHS_ULPI_NXT */
#define USBHS_ULPI_NXT_PC3 \
	GD32_PINMUX_AF('C', 3, AF10)

/* USBHS_ULPI_STP */
#define USBHS_ULPI_STP_PC0 \
	GD32_PINMUX_AF('C', 0, AF10)
